![png](books-erd.png)

In [1]:
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()

import pandas as pd

In [2]:
# create sqlalchemy engine and connection
username = "root"
password = "root"
db_name = "books"

connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

engine = create_engine(connection)

conn = engine.connect()

In [3]:
q = """
    SHOW TABLES;
    """
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [4]:
# import tables from CSV files
users = pd.read_csv('Data/users.csv')
books = pd.read_csv('Data/books.csv')
favorites = pd.read_csv('Data/favorites.csv')
authors = pd.read_csv('Data/authors.csv')

In [5]:
# query to view and compare tables' datatypes with df datatypes
q = """
    DESCRIBE users;
    """
describe = pd.read_sql(q, conn)

describe['Field'].values

array(['id', 'first_name', 'last_name', 'email'], dtype=object)

In [6]:
users.columns

Index(['id', 'first_name', 'last_name', 'email'], dtype='object')

In [7]:
q = """
    DESCRIBE favorites;
    """
describe = pd.read_sql(q, conn)

describe['Field'].values

array(['user_id', 'book_id'], dtype=object)

In [8]:
favorites.columns

Index(['user_id', 'book_id'], dtype='object')

In [9]:
q = """
    DESCRIBE books;
    """
describe = pd.read_sql(q, conn)

describe['Field'].values

array(['id', 'title', 'author_id'], dtype=object)

In [10]:
books.columns

Index(['id', 'title', 'author_id'], dtype='object')

In [11]:
q = """
    DESCRIBE authors;
    """
describe = pd.read_sql(q, conn)

describe['Field'].values

array(['id', 'full_name'], dtype=object)

In [12]:
authors.columns

Index(['id', 'author_name'], dtype='object')

In [13]:
# rename author_name column to full_name
rename_map = {"author_name":"full_name"}

authors = authors.rename(rename_map, axis=1)

authors.columns

authors.head()

   id          full_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [14]:
# show all tables with query

q = """
    SHOW TABLES;
    """
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [15]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

In [16]:
books.to_sql("books",conn,index=False, if_exists='append')

6

In [17]:
favorites.to_sql("favorites",conn,index=False, if_exists='append')

7

In [18]:
users.to_sql("users",conn,index=False, if_exists='append')

3

In [19]:
authors.to_sql("authors",conn,index=False, if_exists='append')

5

In [25]:
# query to list titles of all of John Doe's favorite books
q = """
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""
pd.read_sql(q, conn)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1